diplom-src/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

diplom-src/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

diplom-src/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//***Добавлено Ивашко ВКМ_{
	
	Если Договор.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.АбоненскоеОбслуживание Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Вид договора должен быть ""Абонентсткое обслуживание"".";
		Сообщение.Поле = "Договор";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();   
		Отказ = Истина; 
	КонецЕсли;  
	
	
	Если Договор.ВКМ_НачалаДействия > Дата ИЛИ  Договор.ВКМ_ОкончанияДействия < Дата Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Не действующий договор: %1. Не удалось провести документ.", Договор);
		Сообщение.Сообщить();
		Отказ = Истина; 
	КонецЕсли; 
	// ВКМ_}
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	
	//***Добавлено Ивашко ВКМ_{
	Если ОбменДанными.Загрузка Тогда
     	Возврат;
	КонецЕсли;
	
	Если Ссылка.ДатаПроведенияРабот <> ДатаПроведенияРабот Или 
		Ссылка.ВремяНачалаРабот <> ВремяНачалаРабот Или 
		Ссылка.Специалист <> Специалист Тогда
		ЗаказИзмененНужное = Истина;
	Иначе
		ЗаказИзмененНужное = Ложь;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЗаказИзмененНужное", ЗаказИзмененНужное);		  
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи); 
	//ВКМ_} 
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)   
	
	//***Добавлено Ивашко ВКМ_{	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ЦенаЧасаРаботы КАК ДоговорВКМ_ЦенаЧасаРаботы,
	|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасыКОплатеКлиенту
	|ПОМЕСТИТЬ ВТ_Док
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ПО ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиента.Ссылка
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОбслуживаниеКлиента.Специалист,
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ЦенаЧасаРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|ПОМЕСТИТЬ ВТ_ПроцентСотрудника
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ДатаНачало, Сотрудник = &Сотрудник) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Док.Специалист КАК Специалист,
	|	ЕСТЬNULL(ВТ_ПроцентСотрудника.ПроцентОтРабот, НЕОПРЕДЕЛЕНО) КАК ПроцентОтРабот,
	|	ВТ_Док.ДоговорВКМ_ЦенаЧасаРаботы КАК ЦенаЧаса,
	|	ВТ_Док.ЧасыКОплатеКлиенту КАК КолвоЧасов
	|ИЗ
	|	ВТ_Док КАК ВТ_Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроцентСотрудника КАК ВТ_ПроцентСотрудника
	|		ПО ВТ_Док.Специалист = ВТ_ПроцентСотрудника.Сотрудник";
	
	Запрос.УстановитьПараметр("ДатаНачало", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		ЧасовКОплатеКлиенту = Выборка.КолвоЧасов;
		СтавкаЧасаКлиента = Выборка.ЦенаЧаса;
		ПроцентОтРабот = Выборка.ПроцентОтРабот;
		
		Если  ПроцентОтРабот = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Сотрудник: %1 не указана процентная ставка в условиях оплаты. Не удалось провести документ.", Выборка.Специалист));
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		//регистр ВКМ_ВыполненныеКлиентуРаботы 
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;	
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Количество = ЧасовКОплатеКлиенту;
		Движение.Сумма = ЧасовКОплатеКлиенту*СтавкаЧасаКлиента;
		
		//регистр ВКМ_ВыполненныеСотрудникомРаботы
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ЧасовКОплатеКлиенту;
		Движение.СуммаКОплате = ЧасовКОплатеКлиенту*СтавкаЧасаКлиента*ПроцентОтРабот/100;
		
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Отсутствуют Работы. Не удалось провести документ.");
		Отказ = Истина;
	КонецЕсли;
	
	// ВКМ_}
	
КонецПроцедуры



Процедура ПриЗаписи(Отказ)
	
	//***Добавлено Ивашко ВКМ_{
	
	Если ОбменДанными.Загрузка Тогда
     	Возврат;
	КонецЕсли;

	Если ДополнительныеСвойства.ЭтоНовый Тогда
		
		ТекстСообщения = СтрШаблон("Новый заказ №%1 Исполнитель назначен: %2. Дата: %3 Время %4:%5", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер),Специалист, Формат(ДатаПроведенияРабот, "ДЛФ=Д"),Формат(ВремяНачалаРабот, "ДФ=Ч"), Формат(ВремяНачалаРабот, "ДФ=мм"));
		СпрОбъект = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент(); 
		СпрОбъект.ТекстСообщения = ТекстСообщения;
		СпрОбъект.Записать(); 
	
	ИначеЕсли ДополнительныеСвойства.ЗаказИзмененНужное Тогда   
		
		ТекстСообщения = СтрШаблон("Заказ №%1 изменен!!! Исполнитель назначен: %2. Дата: %3 Время %4:%5", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер),Специалист, Формат(ДатаПроведенияРабот, "ДЛФ=Д"), Формат(ВремяНачалаРабот, "ДФ=Ч"),Формат(ВремяНачалаРабот, "ДФ=мм"));
		СпрОбъект = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент(); 
		СпрОбъект.ТекстСообщения = ТекстСообщения;
		СпрОбъект.Записать(); 
		
	КонецЕсли;
	//ВКМ_Телеграм.ВКМ_ТелеграмУведомление();   //для проверки УДАЛИТЬ
    //ВКМ_} 
	
КонецПроцедуры



#КонецОбласти

#КонецЕсли
